/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_toupper.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: anilchen <anilchen@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/06/12 12:21:14 by anilchen          #+#    #+#             */
/*   Updated: 2024/06/14 13:44:26 by anilchen         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

// Функция toupper в языке программирования C используется для преобразования
// символа в его верхний регистр (большую букву, если это буква).

int	ft_toupper(int c)
{
	if (c >= 'a' && c <= 'z')
	{
		c = c - 32;
	}
	return (c);
}

// #include <stdio.h>

// int	main(void)
// {
// 	char c = 'l';
// 	char res = ft_toupper(c);
// 	printf("%c\n", res);
// 	return (0);
// }