/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_tolower.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: anilchen <anilchen@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/06/12 12:22:05 by anilchen          #+#    #+#             */
/*   Updated: 2024/06/14 13:46:16 by anilchen         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

// Функция tolower в языке программирования C используется для преобразования
// символа в его нижний регистр (малую букву, если это буква).

int	ft_tolower(int c)
{
	if (c >= 'A' && c <= 'Z')
	{
		c = c + 32;
	}
	return (c);
}

// #include <stdio.h>

// int	main(void)
// {
// 	char c = 'K';
// 	char res = ft_tolower(c);
// 	printf("%c\n", res);
// 	return (0);
// }